package lesson_11;

// Ctrl + / - закоментировать строку
// На компьюторе будет создан файл Hello.java #
// Название класса ДОЛЖНО совпадать с названием файла, в котором он написан.

// Метод в Java (функция в Python) - это набор инструкций, которые выполняются вместе.
// Метод main - это специальный метод, который говорит Java с чего начинать выполнять программу.

//    /* ... */ - Многострочный комментарий - аналог """ ... """ в Python

//     Если мы хотим что-то переименовать (Класс, имя переменной, название метода и т.д.) -
//    нужно пользоваться командой меню Rename (Shift + F6)

public class HelloJava {

    /*
    1. Команда 1
    2. Команда 2
    */

    // 1. psvm; 2.main
    // Метод main - стартовая точка программы
    public static void main(String[] args) {
        // Мы можем написать инструкции, которые будут выполнены, при запуске класса Hello
        //sout

        System.out.println("Hello, World!");
        // Ctrl + Y  <- удаление строки
    }
}
