package homeworks.homework_26;

public class Quiz {

    /*
    С помощью какого механизма можно избежать дублирования кода в двух разных классах?
    - наследование

    С помощью какого ключевого слова мы наследуемся
    - extends

    A extends B - где предок, где потомок?
    B - предок
    A - потомок

    С помощью какого модификатора можно сделать так, чтобы метод или поле были доступны в потомке?
    - protected
    - public

    Какие элементы класса-предка (родителя) копируются в классы-потомки?
    - поля
    - методы
    - НЕ копируются конструкторы

    Как принудительно вызвать конструктор предка в конструкторе потомка?
    - super()

    Что будет, если в конструкторе потомка не вызвать явно конструктор предка?
    - Java попытается вызвать пустой конструктор предка (super())
    - А если такого конструктора нет - будет ошибка компиляции - программа не запустится
     */
}
